<a href="https://colab.research.google.com/github/AnirbanMukherjeeXD/Explore-ML-Materials/blob/master/Notebooks/Data_Preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [0]:
import warnings 
warnings.filterwarnings('ignore')
np.set_printoptions(suppress=True)

#Datasets

In [2]:
dataset=pd.read_csv('https://raw.githubusercontent.com/AnirbanMukherjeeXD/Explore-ML-Materials/master/datasets/Product-Purchase-Data.csv')
dataset.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [0]:
X=dataset.iloc[:,:-1]
Y=dataset.iloc[:,-1]

#Visualization

#Missing Data

###Identify

In [0]:
dataset.isnull()

   Country    Age  Salary  Purchased
0    False  False   False      False
1    False  False   False      False
2    False  False   False      False
3    False  False   False      False
4    False  False    True      False
5    False  False   False      False
6    False   True   False      False
7    False  False   False      False
8    False  False   False      False
9    False  False   False      False

In [0]:
dataset.isnull().any()

Country      False
Age           True
Salary        True
Purchased    False
dtype: bool

###Impute

In [0]:
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [0]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy = 'mean')
imputer = imputer.fit(X.iloc[:, 1:3])
X.iloc[:, 1:3] = imputer.transform(X.iloc[:, 1:3])

In [79]:
np.isnan(X).any()

False

#Outliers

#Categorical Data

##Label Encoding

In [0]:
X

   Country        Age        Salary
0   France  44.000000  72000.000000
1    Spain  27.000000  48000.000000
2  Germany  30.000000  54000.000000
3    Spain  38.000000  61000.000000
4  Germany  40.000000  63777.777778
5   France  35.000000  58000.000000
6    Spain  38.777778  52000.000000
7   France  48.000000  79000.000000
8  Germany  50.000000  83000.000000
9   France  37.000000  67000.000000

In [0]:
from sklearn.preprocessing import LabelEncoder

# Encoding the Independent Variable
labelencoder_X = LabelEncoder()
X.iloc[:, 0] = labelencoder_X.fit_transform(X.iloc[:, 0])

# Encoding the Dependent Variable
labelencoder_Y = LabelEncoder()
Y = labelencoder_Y.fit_transform(Y)

In [0]:
X

   Country        Age        Salary
0        0  44.000000  72000.000000
1        2  27.000000  48000.000000
2        1  30.000000  54000.000000
3        2  38.000000  61000.000000
4        1  40.000000  63777.777778
5        0  35.000000  58000.000000
6        2  38.777778  52000.000000
7        0  48.000000  79000.000000
8        1  50.000000  83000.000000
9        0  37.000000  67000.000000

##One-hot Encoding

In [0]:
from sklearn.preprocessing import OneHotEncoder

onehotencoder = OneHotEncoder(categorical_features = [0])
X = onehotencoder.fit_transform(X).toarray()

In [62]:
X

array([[    1.        ,     0.        ,     0.        ,    44.        ,
        72000.        ],
       [    0.        ,     0.        ,     1.        ,    27.        ,
        48000.        ],
       [    0.        ,     1.        ,     0.        ,    30.        ,
        54000.        ],
       [    0.        ,     0.        ,     1.        ,    38.        ,
        61000.        ],
       [    0.        ,     1.        ,     0.        ,    40.        ,
        63777.77777778],
       [    1.        ,     0.        ,     0.        ,    35.        ,
        58000.        ],
       [    0.        ,     0.        ,     1.        ,    38.77777778,
        52000.        ],
       [    1.        ,     0.        ,     0.        ,    48.        ,
        79000.        ],
       [    0.        ,     1.        ,     0.        ,    50.        ,
        83000.        ],
       [    1.        ,     0.        ,     0.        ,    37.        ,
        67000.        ]])

#Feature Scaling

In [ ]:
print(np.mean(X,axis=0))
print(np.std(X,axis=0))

**Standardizing**

$$z = {x-\mu \over \sigma}.$$

In [ ]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
X = scaler.fit_transform(X)

#scaler_Y = StandardScaler()
#y_train = scaler_Y.fit_transform(y_train)

In [74]:
print(np.mean(X,axis=0))
print(np.std(X,axis=0))

[-0.  0. -0. -0.  0.]
[1. 1. 1. 1. 1.]